; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x8-y8-t4-k4444-l4444-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f f7-0f 
        f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f f7-1f 
        f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f f7-2f 
        f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f f7-3f 
        f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f f7-4f 
        f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f f7-5f 
        f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f f7-6f 
        f0-7f f1-7f f2-7f f3-7f f4-7f f5-7f f6-7f f7-7f 
        shape0 shape1 shape2 shape3 
        key0-0 key0-1 key0-2 key0-3 
        key1-0 key1-1 key1-2 key1-3 
        key2-0 key2-1 key2-2 key2-3 
        key3-0 key3-1 key3-2 key3-3 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f2-0f)
(place f3-0f)
(place f4-0f)
(place f5-0f)
(place f6-0f)
(place f7-0f)
(place f0-1f)
(place f1-1f)
(place f2-1f)
(place f3-1f)
(place f4-1f)
(place f5-1f)
(place f6-1f)
(place f7-1f)
(place f0-2f)
(place f1-2f)
(place f2-2f)
(place f3-2f)
(place f4-2f)
(place f5-2f)
(place f6-2f)
(place f7-2f)
(place f0-3f)
(place f1-3f)
(place f2-3f)
(place f3-3f)
(place f4-3f)
(place f5-3f)
(place f6-3f)
(place f7-3f)
(place f0-4f)
(place f1-4f)
(place f2-4f)
(place f3-4f)
(place f4-4f)
(place f5-4f)
(place f6-4f)
(place f7-4f)
(place f0-5f)
(place f1-5f)
(place f2-5f)
(place f3-5f)
(place f4-5f)
(place f5-5f)
(place f6-5f)
(place f7-5f)
(place f0-6f)
(place f1-6f)
(place f2-6f)
(place f3-6f)
(place f4-6f)
(place f5-6f)
(place f6-6f)
(place f7-6f)
(place f0-7f)
(place f1-7f)
(place f2-7f)
(place f3-7f)
(place f4-7f)
(place f5-7f)
(place f6-7f)
(place f7-7f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key0-2)
(key-shape key0-2 shape0)
(key key0-3)
(key-shape key0-3 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key1-2)
(key-shape key1-2 shape1)
(key key1-3)
(key-shape key1-3 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(key key2-2)
(key-shape key2-2 shape2)
(key key2-3)
(key-shape key2-3 shape2)
(key key3-0)
(key-shape key3-0 shape3)
(key key3-1)
(key-shape key3-1 shape3)
(key key3-2)
(key-shape key3-2 shape3)
(key key3-3)
(key-shape key3-3 shape3)
(conn f0-0f f1-0f)
(conn f1-0f f2-0f)
(conn f2-0f f3-0f)
(conn f3-0f f4-0f)
(conn f4-0f f5-0f)
(conn f5-0f f6-0f)
(conn f6-0f f7-0f)
(conn f0-1f f1-1f)
(conn f1-1f f2-1f)
(conn f2-1f f3-1f)
(conn f3-1f f4-1f)
(conn f4-1f f5-1f)
(conn f5-1f f6-1f)
(conn f6-1f f7-1f)
(conn f0-2f f1-2f)
(conn f1-2f f2-2f)
(conn f2-2f f3-2f)
(conn f3-2f f4-2f)
(conn f4-2f f5-2f)
(conn f5-2f f6-2f)
(conn f6-2f f7-2f)
(conn f0-3f f1-3f)
(conn f1-3f f2-3f)
(conn f2-3f f3-3f)
(conn f3-3f f4-3f)
(conn f4-3f f5-3f)
(conn f5-3f f6-3f)
(conn f6-3f f7-3f)
(conn f0-4f f1-4f)
(conn f1-4f f2-4f)
(conn f2-4f f3-4f)
(conn f3-4f f4-4f)
(conn f4-4f f5-4f)
(conn f5-4f f6-4f)
(conn f6-4f f7-4f)
(conn f0-5f f1-5f)
(conn f1-5f f2-5f)
(conn f2-5f f3-5f)
(conn f3-5f f4-5f)
(conn f4-5f f5-5f)
(conn f5-5f f6-5f)
(conn f6-5f f7-5f)
(conn f0-6f f1-6f)
(conn f1-6f f2-6f)
(conn f2-6f f3-6f)
(conn f3-6f f4-6f)
(conn f4-6f f5-6f)
(conn f5-6f f6-6f)
(conn f6-6f f7-6f)
(conn f0-7f f1-7f)
(conn f1-7f f2-7f)
(conn f2-7f f3-7f)
(conn f3-7f f4-7f)
(conn f4-7f f5-7f)
(conn f5-7f f6-7f)
(conn f6-7f f7-7f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f2-0f f2-1f)
(conn f3-0f f3-1f)
(conn f4-0f f4-1f)
(conn f5-0f f5-1f)
(conn f6-0f f6-1f)
(conn f7-0f f7-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f2-1f f2-2f)
(conn f3-1f f3-2f)
(conn f4-1f f4-2f)
(conn f5-1f f5-2f)
(conn f6-1f f6-2f)
(conn f7-1f f7-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f2-2f f2-3f)
(conn f3-2f f3-3f)
(conn f4-2f f4-3f)
(conn f5-2f f5-3f)
(conn f6-2f f6-3f)
(conn f7-2f f7-3f)
(conn f0-3f f0-4f)
(conn f1-3f f1-4f)
(conn f2-3f f2-4f)
(conn f3-3f f3-4f)
(conn f4-3f f4-4f)
(conn f5-3f f5-4f)
(conn f6-3f f6-4f)
(conn f7-3f f7-4f)
(conn f0-4f f0-5f)
(conn f1-4f f1-5f)
(conn f2-4f f2-5f)
(conn f3-4f f3-5f)
(conn f4-4f f4-5f)
(conn f5-4f f5-5f)
(conn f6-4f f6-5f)
(conn f7-4f f7-5f)
(conn f0-5f f0-6f)
(conn f1-5f f1-6f)
(conn f2-5f f2-6f)
(conn f3-5f f3-6f)
(conn f4-5f f4-6f)
(conn f5-5f f5-6f)
(conn f6-5f f6-6f)
(conn f7-5f f7-6f)
(conn f0-6f f0-7f)
(conn f1-6f f1-7f)
(conn f2-6f f2-7f)
(conn f3-6f f3-7f)
(conn f4-6f f4-7f)
(conn f5-6f f5-7f)
(conn f6-6f f6-7f)
(conn f7-6f f7-7f)
(conn f1-0f f0-0f)
(conn f2-0f f1-0f)
(conn f3-0f f2-0f)
(conn f4-0f f3-0f)
(conn f5-0f f4-0f)
(conn f6-0f f5-0f)
(conn f7-0f f6-0f)
(conn f1-1f f0-1f)
(conn f2-1f f1-1f)
(conn f3-1f f2-1f)
(conn f4-1f f3-1f)
(conn f5-1f f4-1f)
(conn f6-1f f5-1f)
(conn f7-1f f6-1f)
(conn f1-2f f0-2f)
(conn f2-2f f1-2f)
(conn f3-2f f2-2f)
(conn f4-2f f3-2f)
(conn f5-2f f4-2f)
(conn f6-2f f5-2f)
(conn f7-2f f6-2f)
(conn f1-3f f0-3f)
(conn f2-3f f1-3f)
(conn f3-3f f2-3f)
(conn f4-3f f3-3f)
(conn f5-3f f4-3f)
(conn f6-3f f5-3f)
(conn f7-3f f6-3f)
(conn f1-4f f0-4f)
(conn f2-4f f1-4f)
(conn f3-4f f2-4f)
(conn f4-4f f3-4f)
(conn f5-4f f4-4f)
(conn f6-4f f5-4f)
(conn f7-4f f6-4f)
(conn f1-5f f0-5f)
(conn f2-5f f1-5f)
(conn f3-5f f2-5f)
(conn f4-5f f3-5f)
(conn f5-5f f4-5f)
(conn f6-5f f5-5f)
(conn f7-5f f6-5f)
(conn f1-6f f0-6f)
(conn f2-6f f1-6f)
(conn f3-6f f2-6f)
(conn f4-6f f3-6f)
(conn f5-6f f4-6f)
(conn f6-6f f5-6f)
(conn f7-6f f6-6f)
(conn f1-7f f0-7f)
(conn f2-7f f1-7f)
(conn f3-7f f2-7f)
(conn f4-7f f3-7f)
(conn f5-7f f4-7f)
(conn f6-7f f5-7f)
(conn f7-7f f6-7f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f2-1f f2-0f)
(conn f3-1f f3-0f)
(conn f4-1f f4-0f)
(conn f5-1f f5-0f)
(conn f6-1f f6-0f)
(conn f7-1f f7-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f2-2f f2-1f)
(conn f3-2f f3-1f)
(conn f4-2f f4-1f)
(conn f5-2f f5-1f)
(conn f6-2f f6-1f)
(conn f7-2f f7-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(conn f2-3f f2-2f)
(conn f3-3f f3-2f)
(conn f4-3f f4-2f)
(conn f5-3f f5-2f)
(conn f6-3f f6-2f)
(conn f7-3f f7-2f)
(conn f0-4f f0-3f)
(conn f1-4f f1-3f)
(conn f2-4f f2-3f)
(conn f3-4f f3-3f)
(conn f4-4f f4-3f)
(conn f5-4f f5-3f)
(conn f6-4f f6-3f)
(conn f7-4f f7-3f)
(conn f0-5f f0-4f)
(conn f1-5f f1-4f)
(conn f2-5f f2-4f)
(conn f3-5f f3-4f)
(conn f4-5f f4-4f)
(conn f5-5f f5-4f)
(conn f6-5f f6-4f)
(conn f7-5f f7-4f)
(conn f0-6f f0-5f)
(conn f1-6f f1-5f)
(conn f2-6f f2-5f)
(conn f3-6f f3-5f)
(conn f4-6f f4-5f)
(conn f5-6f f5-5f)
(conn f6-6f f6-5f)
(conn f7-6f f7-5f)
(conn f0-7f f0-6f)
(conn f1-7f f1-6f)
(conn f2-7f f2-6f)
(conn f3-7f f3-6f)
(conn f4-7f f4-6f)
(conn f5-7f f5-6f)
(conn f6-7f f6-6f)
(conn f7-7f f7-6f)
(open f0-0f)
(open f5-0f)
(open f6-0f)
(open f7-0f)
(open f0-1f)
(open f2-1f)
(open f3-1f)
(open f4-1f)
(open f5-1f)
(open f6-1f)
(open f7-1f)
(open f0-2f)
(open f2-2f)
(open f3-2f)
(open f4-2f)
(open f5-2f)
(open f6-2f)
(open f3-3f)
(open f4-3f)
(open f6-3f)
(open f7-3f)
(open f0-4f)
(open f1-4f)
(open f2-4f)
(open f3-4f)
(open f4-4f)
(open f5-4f)
(open f7-4f)
(open f0-5f)
(open f1-5f)
(open f2-5f)
(open f4-5f)
(open f5-5f)
(open f6-5f)
(open f7-5f)
(open f0-6f)
(open f1-6f)
(open f2-6f)
(open f4-6f)
(open f5-6f)
(open f6-6f)
(open f7-6f)
(open f0-7f)
(open f1-7f)
(open f2-7f)
(open f3-7f)
(open f4-7f)
(open f7-7f)
(locked f2-0f)
(lock-shape f2-0f shape0)
(locked f2-3f)
(lock-shape f2-3f shape0)
(locked f1-3f)
(lock-shape f1-3f shape0)
(locked f0-3f)
(lock-shape f0-3f shape0)
(locked f4-0f)
(lock-shape f4-0f shape1)
(locked f6-7f)
(lock-shape f6-7f shape1)
(locked f7-2f)
(lock-shape f7-2f shape1)
(locked f3-5f)
(lock-shape f3-5f shape1)
(locked f1-1f)
(lock-shape f1-1f shape2)
(locked f3-0f)
(lock-shape f3-0f shape2)
(locked f5-7f)
(lock-shape f5-7f shape2)
(locked f6-4f)
(lock-shape f6-4f shape2)
(locked f1-0f)
(lock-shape f1-0f shape3)
(locked f5-3f)
(lock-shape f5-3f shape3)
(locked f3-6f)
(lock-shape f3-6f shape3)
(locked f1-2f)
(lock-shape f1-2f shape3)
(at key0-0 f4-2f)
(at key0-1 f5-3f)
(at key0-2 f1-4f)
(at key0-3 f5-4f)
(at key1-0 f1-6f)
(at key1-1 f6-5f)
(at key1-2 f6-3f)
(at key1-3 f4-5f)
(at key2-0 f6-1f)
(at key2-1 f4-4f)
(at key2-2 f6-5f)
(at key2-3 f4-3f)
(at key3-0 f0-7f)
(at key3-1 f1-6f)
(at key3-2 f3-2f)
(at key3-3 f0-0f)
(at-robot f4-6f)
)
(:goal
(and
(at key1-0 f0-2f)
(at key1-1 f6-0f)
(at key1-2 f5-3f)
(at key1-3 f2-1f)
(at key2-3 f4-1f)
(at key3-0 f5-1f)
(at key3-2 f4-2f)
)
)
)

; plan
1. (move f4-6f f4-5f)
   deleted: (at-robot f4-6f)
   added: (at-robot f4-5f)
   goals met: 0 of 7
2. (move f4-5f f4-4f)
   deleted: (at-robot f4-5f)
   added: (at-robot f4-4f)
   goals met: 0 of 7
3. (move f4-4f f3-4f)
   deleted: (at-robot f4-4f)
   added: (at-robot f3-4f)
   goals met: 0 of 7
4. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 0 of 7
5. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 0 of 7
6. (pickup f4-3f key2-3)
   deleted: (at key2-3 f4-3f) (arm-empty)
   added: (holding key2-3)
   goals met: 0 of 7
7. (move f4-3f f4-2f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-2f)
   goals met: 0 of 7
8. (move f4-2f f4-1f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-1f)
   goals met: 0 of 7
9. (putdown f4-1f key2-3)
   deleted: (holding key2-3)
   added: (arm-empty) (at key2-3 f4-1f)
   goals met: 1 of 7
10. (move f4-1f f4-2f)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-2f)
   goals met: 1 of 7
11. (move f4-2f f3-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f3-2f)
   goals met: 1 of 7
12. (pickup f3-2f key3-2)
   deleted: (at key3-2 f3-2f) (arm-empty)
   added: (holding key3-2)
   goals met: 1 of 7
13. (move f3-2f f2-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f2-2f)
   goals met: 1 of 7
14. (unlock f2-2f f1-2f key3-2 shape3)
   deleted: (locked f1-2f)
   added: (open f1-2f)
   goals met: 1 of 7
15. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 1 of 7
16. (move f3-2f f4-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f4-2f)
   goals met: 1 of 7
17. (move f4-2f f4-3f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-3f)
   goals met: 1 of 7
18. (unlock f4-3f f5-3f key3-2 shape3)
   deleted: (locked f5-3f)
   added: (open f5-3f)
   goals met: 1 of 7
19. (move f4-3f f4-2f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-2f)
   goals met: 1 of 7
20. (putdown f4-2f key3-2)
   deleted: (holding key3-2)
   added: (arm-empty) (at key3-2 f4-2f)
   goals met: 2 of 7
21. (move f4-2f f4-3f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-3f)
   goals met: 2 of 7
22. (move f4-3f f4-4f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-4f)
   goals met: 2 of 7
23. (move f4-4f f4-5f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-5f)
   goals met: 2 of 7
24. (pickup f4-5f key1-3)
   deleted: (at key1-3 f4-5f) (arm-empty)
   added: (holding key1-3)
   goals met: 2 of 7
25. (move f4-5f f4-4f)
   deleted: (at-robot f4-5f)
   added: (at-robot f4-4f)
   goals met: 2 of 7
26. (move f4-4f f4-3f)
   deleted: (at-robot f4-4f)
   added: (at-robot f4-3f)
   goals met: 2 of 7
27. (move f4-3f f5-3f)
   deleted: (at-robot f4-3f)
   added: (at-robot f5-3f)
   goals met: 2 of 7
28. (move f5-3f f6-3f)
   deleted: (at-robot f5-3f)
   added: (at-robot f6-3f)
   goals met: 2 of 7
29. (pickup-and-loose f6-3f key1-2 key1-3)
   deleted: (holding key1-3) (at key1-2 f6-3f)
   added: (holding key1-2) (at key1-3 f6-3f)
   goals met: 2 of 7
30. (move f6-3f f5-3f)
   deleted: (at-robot f6-3f)
   added: (at-robot f5-3f)
   goals met: 2 of 7
31. (putdown f5-3f key1-2)
   deleted: (holding key1-2)
   added: (arm-empty) (at key1-2 f5-3f)
   goals met: 3 of 7
32. (move f5-3f f6-3f)
   deleted: (at-robot f5-3f)
   added: (at-robot f6-3f)
   goals met: 3 of 7
33. (pickup f6-3f key1-3)
   deleted: (at key1-3 f6-3f) (arm-empty)
   added: (holding key1-3)
   goals met: 3 of 7
34. (move f6-3f f6-2f)
   deleted: (at-robot f6-3f)
   added: (at-robot f6-2f)
   goals met: 3 of 7
35. (move f6-2f f5-2f)
   deleted: (at-robot f6-2f)
   added: (at-robot f5-2f)
   goals met: 3 of 7
36. (move f5-2f f4-2f)
   deleted: (at-robot f5-2f)
   added: (at-robot f4-2f)
   goals met: 3 of 7
37. (move f4-2f f3-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f3-2f)
   goals met: 3 of 7
38. (move f3-2f f2-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f2-2f)
   goals met: 3 of 7
39. (move f2-2f f2-1f)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-1f)
   goals met: 3 of 7
40. (putdown f2-1f key1-3)
   deleted: (holding key1-3)
   added: (arm-empty) (at key1-3 f2-1f)
   goals met: 4 of 7
41. (move f2-1f f2-2f)
   deleted: (at-robot f2-1f)
   added: (at-robot f2-2f)
   goals met: 4 of 7
42. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 4 of 7
43. (move f3-2f f4-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f4-2f)
   goals met: 4 of 7
44. (move f4-2f f4-3f)
   deleted: (at-robot f4-2f)
   added: (at-robot f4-3f)
   goals met: 4 of 7
45. (move f4-3f f4-4f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-4f)
   goals met: 4 of 7
46. (move f4-4f f3-4f)
   deleted: (at-robot f4-4f)
   added: (at-robot f3-4f)
   goals met: 4 of 7
47. (move f3-4f f2-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f2-4f)
   goals met: 4 of 7
48. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 4 of 7
49. (move f2-5f f2-6f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-6f)
   goals met: 4 of 7
50. (move f2-6f f2-7f)
   deleted: (at-robot f2-6f)
   added: (at-robot f2-7f)
   goals met: 4 of 7
51. (move f2-7f f3-7f)
   deleted: (at-robot f2-7f)
   added: (at-robot f3-7f)
   goals met: 4 of 7
52. (move f3-7f f4-7f)
   deleted: (at-robot f3-7f)
   added: (at-robot f4-7f)
   goals met: 4 of 7
53. (move f4-7f f4-6f)
   deleted: (at-robot f4-7f)
   added: (at-robot f4-6f)
   goals met: 4 of 7
54. (move f4-6f f5-6f)
   deleted: (at-robot f4-6f)
   added: (at-robot f5-6f)
   goals met: 4 of 7
55. (move f5-6f f6-6f)
   deleted: (at-robot f5-6f)
   added: (at-robot f6-6f)
   goals met: 4 of 7
56. (move f6-6f f6-5f)
   deleted: (at-robot f6-6f)
   added: (at-robot f6-5f)
   goals met: 4 of 7
57. (pickup f6-5f key1-1)
   deleted: (at key1-1 f6-5f) (arm-empty)
   added: (holding key1-1)
   goals met: 4 of 7
58. (move f6-5f f5-5f)
   deleted: (at-robot f6-5f)
   added: (at-robot f5-5f)
   goals met: 4 of 7
59. (move f5-5f f5-4f)
   deleted: (at-robot f5-5f)
   added: (at-robot f5-4f)
   goals met: 4 of 7
60. (move f5-4f f4-4f)
   deleted: (at-robot f5-4f)
   added: (at-robot f4-4f)
   goals met: 4 of 7
61. (move f4-4f f3-4f)
   deleted: (at-robot f4-4f)
   added: (at-robot f3-4f)
   goals met: 4 of 7
62. (move f3-4f f2-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f2-4f)
   goals met: 4 of 7
63. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 4 of 7
64. (move f2-5f f2-6f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-6f)
   goals met: 4 of 7
65. (move f2-6f f1-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f1-6f)
   goals met: 4 of 7
66. (pickup-and-loose f1-6f key1-0 key1-1)
   deleted: (holding key1-1) (at key1-0 f1-6f)
   added: (holding key1-0) (at key1-1 f1-6f)
   goals met: 4 of 7
67. (move f1-6f f1-5f)
   deleted: (at-robot f1-6f)
   added: (at-robot f1-5f)
   goals met: 4 of 7
68. (move f1-5f f2-5f)
   deleted: (at-robot f1-5f)
   added: (at-robot f2-5f)
   goals met: 4 of 7
69. (move f2-5f f2-4f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-4f)
   goals met: 4 of 7
70. (move f2-4f f3-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f3-4f)
   goals met: 4 of 7
71. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 4 of 7
72. (move f3-3f f3-2f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-2f)
   goals met: 4 of 7
73. (move f3-2f f2-2f)
   deleted: (at-robot f3-2f)
   added: (at-robot f2-2f)
   goals met: 4 of 7
74. (move f2-2f f1-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f1-2f)
   goals met: 4 of 7
75. (move f1-2f f0-2f)
   deleted: (at-robot f1-2f)
   added: (at-robot f0-2f)
   goals met: 4 of 7
76. (putdown f0-2f key1-0)
   deleted: (holding key1-0)
   added: (arm-empty) (at key1-0 f0-2f)
   goals met: 5 of 7
77. (move f0-2f f1-2f)
   deleted: (at-robot f0-2f)
   added: (at-robot f1-2f)
   goals met: 5 of 7
78. (move f1-2f f2-2f)
   deleted: (at-robot f1-2f)
   added: (at-robot f2-2f)
   goals met: 5 of 7
79. (move f2-2f f3-2f)
   deleted: (at-robot f2-2f)
   added: (at-robot f3-2f)
   goals met: 5 of 7
80. (move f3-2f f3-3f)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-3f)
   goals met: 5 of 7
81. (move f3-3f f3-4f)
   deleted: (at-robot f3-3f)
   added: (at-robot f3-4f)
   goals met: 5 of 7
82. (move f3-4f f2-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f2-4f)
   goals met: 5 of 7
83. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 5 of 7
84. (move f2-5f f2-6f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-6f)
   goals met: 5 of 7
85. (move f2-6f f1-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f1-6f)
   goals met: 5 of 7
86. (pickup f1-6f key1-1)
   deleted: (at key1-1 f1-6f) (arm-empty)
   added: (holding key1-1)
   goals met: 5 of 7
87. (move f1-6f f1-7f)
   deleted: (at-robot f1-6f)
   added: (at-robot f1-7f)
   goals met: 5 of 7
88. (move f1-7f f0-7f)
   deleted: (at-robot f1-7f)
   added: (at-robot f0-7f)
   goals met: 5 of 7
89. (pickup-and-loose f0-7f key3-0 key1-1)
   deleted: (holding key1-1) (at key3-0 f0-7f)
   added: (holding key3-0) (at key1-1 f0-7f)
   goals met: 5 of 7
90. (move f0-7f f0-6f)
   deleted: (at-robot f0-7f)
   added: (at-robot f0-6f)
   goals met: 5 of 7
91. (move f0-6f f1-6f)
   deleted: (at-robot f0-6f)
   added: (at-robot f1-6f)
   goals met: 5 of 7
92. (move f1-6f f1-5f)
   deleted: (at-robot f1-6f)
   added: (at-robot f1-5f)
   goals met: 5 of 7
93. (move f1-5f f2-5f)
   deleted: (at-robot f1-5f)
   added: (at-robot f2-5f)
   goals met: 5 of 7
94. (move f2-5f f2-4f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-4f)
   goals met: 5 of 7
95. (move f2-4f f3-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f3-4f)
   goals met: 5 of 7
96. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 5 of 7
97. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 5 of 7
98. (move f4-3f f4-2f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-2f)
   goals met: 5 of 7
99. (move f4-2f f5-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f5-2f)
   goals met: 5 of 7
100. (move f5-2f f5-1f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-1f)
   goals met: 5 of 7
101. (putdown f5-1f key3-0)
   deleted: (holding key3-0)
   added: (arm-empty) (at key3-0 f5-1f)
   goals met: 6 of 7
102. (move f5-1f f5-2f)
   deleted: (at-robot f5-1f)
   added: (at-robot f5-2f)
   goals met: 6 of 7
103. (move f5-2f f5-3f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-3f)
   goals met: 6 of 7
104. (move f5-3f f4-3f)
   deleted: (at-robot f5-3f)
   added: (at-robot f4-3f)
   goals met: 6 of 7
105. (move f4-3f f4-4f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-4f)
   goals met: 6 of 7
106. (move f4-4f f3-4f)
   deleted: (at-robot f4-4f)
   added: (at-robot f3-4f)
   goals met: 6 of 7
107. (move f3-4f f2-4f)
   deleted: (at-robot f3-4f)
   added: (at-robot f2-4f)
   goals met: 6 of 7
108. (move f2-4f f2-5f)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-5f)
   goals met: 6 of 7
109. (move f2-5f f2-6f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-6f)
   goals met: 6 of 7
110. (move f2-6f f1-6f)
   deleted: (at-robot f2-6f)
   added: (at-robot f1-6f)
   goals met: 6 of 7
111. (move f1-6f f1-7f)
   deleted: (at-robot f1-6f)
   added: (at-robot f1-7f)
   goals met: 6 of 7
112. (move f1-7f f0-7f)
   deleted: (at-robot f1-7f)
   added: (at-robot f0-7f)
   goals met: 6 of 7
113. (pickup f0-7f key1-1)
   deleted: (at key1-1 f0-7f) (arm-empty)
   added: (holding key1-1)
   goals met: 6 of 7
114. (move f0-7f f0-6f)
   deleted: (at-robot f0-7f)
   added: (at-robot f0-6f)
   goals met: 6 of 7
115. (move f0-6f f1-6f)
   deleted: (at-robot f0-6f)
   added: (at-robot f1-6f)
   goals met: 6 of 7
116. (move f1-6f f1-5f)
   deleted: (at-robot f1-6f)
   added: (at-robot f1-5f)
   goals met: 6 of 7
117. (move f1-5f f2-5f)
   deleted: (at-robot f1-5f)
   added: (at-robot f2-5f)
   goals met: 6 of 7
118. (move f2-5f f2-4f)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-4f)
   goals met: 6 of 7
119. (move f2-4f f3-4f)
   deleted: (at-robot f2-4f)
   added: (at-robot f3-4f)
   goals met: 6 of 7
120. (move f3-4f f3-3f)
   deleted: (at-robot f3-4f)
   added: (at-robot f3-3f)
   goals met: 6 of 7
121. (move f3-3f f4-3f)
   deleted: (at-robot f3-3f)
   added: (at-robot f4-3f)
   goals met: 6 of 7
122. (move f4-3f f4-2f)
   deleted: (at-robot f4-3f)
   added: (at-robot f4-2f)
   goals met: 6 of 7
123. (move f4-2f f5-2f)
   deleted: (at-robot f4-2f)
   added: (at-robot f5-2f)
   goals met: 6 of 7
124. (move f5-2f f5-1f)
   deleted: (at-robot f5-2f)
   added: (at-robot f5-1f)
   goals met: 6 of 7
125. (move f5-1f f6-1f)
   deleted: (at-robot f5-1f)
   added: (at-robot f6-1f)
   goals met: 6 of 7
126. (move f6-1f f6-0f)
   deleted: (at-robot f6-1f)
   added: (at-robot f6-0f)
   goals met: 6 of 7
127. (putdown f6-0f key1-1)
   deleted: (holding key1-1)
   added: (arm-empty) (at key1-1 f6-0f)
   goals met: 7 of 7
